#############################################################
#  Συγγραφέας   Δημήτρης Κάντζας
#  email        dimitriosk07 [at] gmail [dot] com
#  Ενότητα      4.for
#  Κατηγορία    Εξωπλανήτες
#############################################################


'''
Αυτό ο κώδικας βρίσκει ποιος εξωπλανήτης μεταξύ πέντε γνωστών ειναι πιο
κατάλληλος για εποικισμό ελέγχοντας κάποια συγκεκριμένα κριτήρια.


Ακολουθεί η λίστα με τους 5 εξωπλανήτες:
(Σημείωση: για κάθε εξωπλανήτη δίνεται το όνομα, η επιφανειακή θερμοκρασία
σε βαθμούς Κελσίου, η απόσταση από τη Γη σε έτη φωτός, η μάζα σε
γήινες μάζες και αν είναι γήινος ή hot Jupiter.
'''

#Πρώτος εξωπλανήτης (υπερ-Γη):
exoplanet_1 = ['55 Cancri e', 1700, 40.0, 8.6, 'γήινος']

#Δευτερος εξωπλανήτης (γήινος):
exoplanet_2 = ['Trappist-1e', -20, 40.0, 0.6, 'γήινος']

#Τρίτος εξωπλανήτης (θερμός αέριος τύπου Δία):
exoplanet_3 = ['Kelt-9b', 10000, 650.0, 922.2, 'hot Jupiter']

#Τέταρτος εξωπλανήτης (θερμός αέριος τύπου Δία):
exoplanet_4 = ['Wasp 76-b', 2400, 640.0, 286.2, 'hot Jupiter']

#Πέμπτος εξωπλανήτης (γήινος):
exoplanet_5 = ['Proxima b', 40, 4.2, 1.2, 'γήινος']


#############################################################
# Αρχικά φτιάχουμε μια λίστα με τα ονόματα όλων των πλανητών:
#############################################################

# Ορίζουμε έναν δείκτη (index) για να μπορέσουμε να πάρουμε το όνομα
# κάθε πλανήτη από τις παραπάνω λίστες αυτόματα. Το όνομα δίνεται από
# το μηδενικό στοιχείο της κάθε λίστας.
index = 0 
names = [exoplanet_1[index],exoplanet_2[index],exoplanet_3[index],
         exoplanet_4[index],exoplanet_5[index]]


#############################################################
# Ορίζουμε τώρα μια λίστα με τις θερμοκρασίες των πλανητών:
#############################################################

# Η θερμοκρασία δίνεται από το 1ο στοιχείο του κάθε εξωπλανήτη.
# -- σε αυτή τη σειρά ο δείκτης index έχει τιμή 0
index = 1 # -- σε αυτή τη σειρά ο δείκτης index έχει τιμή 1
temps = [exoplanet_1[index],exoplanet_2[index],exoplanet_3[index],
         exoplanet_4[index],exoplanet_5[index]]


#############################################################
# Ορίζουμε τώρα μια λίστα με την πληροφορία αν ο εξωπλανήτης
# είναι γήινος ή hot Jupiter.
#############################################################

# Ο τύπος δίνεται από το 4ο στοιχείο του κάθε εξωπλανήτη.
# -- σε αυτή τη σειρά ο δείκτης index έχει τιμή 1
index=4 # -- σε αυτή τη σειρά ο δείκτης index έχει τιμή 4
types = [exoplanet_1[index],exoplanet_2[index],exoplanet_3[index],
         exoplanet_4[index],exoplanet_5[index]]
# Σημείωση! Χρησιμοποιούμε το όνομα types για το είδος γιατί το όνομα type
# είναι συνάρτηση της Python!


#############################################################
# Ορίζουμε τώρα μια λίστα με τις αποστάσεις των εξωπλανητών:
#############################################################

# Η απόσταση δίνεται από το 2ο στοιχείο του κάθε εξωπλανήτη.
index=2
distances = [exoplanet_1[index],exoplanet_2[index],exoplanet_3[index],
         exoplanet_4[index],exoplanet_5[index]]


#############################################################
# Ορίζουμε μια μεταβλητή που θα δίνει το μέγεθος της κάθε μιας από τις
# παραπάνω λίστες (στην πραγματικότητα πρόκειται για τον αριθμό των
# εξωπλανητών που μελετάμε)
#############################################################
n = len(names)


#############################################################
# Ελέγχουμε αν κάποιος πλανήτης από τους παραπάνω θα μπορούσε να
# φιλοξενήσει ζωή βάσει της επιφανειακής θερμοκρασίας και του
# τύπου (γήινος ή hot Jupiter)
#############################################################

for i in range(n):
    print('\nO εξωπλανήτης',names[i],':')
    if temps[i]<50:
        print('Έχει θερμοκρασία κοντά στη γήινη')
    else:
        print('Είναι πολύ θερμός')

    if types[i]=='γήινος':
        print('και είναι γήινος πλανήτης.')
    else:
        print('και είναι τύπου καυτού Δία.')

    if temps[i]<50 and types[i]=='γήινος':
        print('Άρα αυτός ο πλανήτης θα μπορούσε να φιλοξενήσει ζωή!')
    else:
        print('Άρα δε θα μπορούσε να φιλοξενήσει ζωή...')



    
