#############################################################
#  Συγγραφέας   Δημήτρης Κάντζας
#  email        dimitriosk07 [at] gmail [dot] com
#  Ενότητα      4.for
#  Κατηγορία    Εξωπλανήτες
#############################################################

'''
Ο συγκεκριμένος κώδικας μελετάει το σύστημα Kepler-186 με τους 5
εξωπλανήτες. Βρείτε τα συντακτικά λάθη τα οποία θα επιτρέψουν στον κώδικα
να τρέξει, καθώς και τα λογικά λάθη τα οποία οδηγούν σε λάθος συμπεράσματα.
ΣΗΜΕΙΩΣΗ: υπάρχει τουλάχιστον ένα λάθος ανά σειρά! Επίσης η εικόνα από το
μάθημα θα σας φανεί αρκετά χρήσιμη.
'''

'''Ακολουθούν ακόμα συνολικά  23  λάθη:'''

#Η λίστα με τους κωδικούς των 5 πλανητών του συστήματος:
planet = ['b', 'c', 'd', 'e', f]

#Η λίστα με τις περιόδους περιφοράς των πλανητών γύρω από το αστέρι τους
#μετρούμενες σε γήινες ημέρες:
period = 3.887, 7.267, 13.343, 22.408, 129.944

#Η λίστα με τη μέση απόσταση των πλανητών από το αστέρι τους 
#μετρούμενες σε αστρονομικές μονάδες AU:
orbit = [0,034, 0,045, 0,078, 0,11, 0,43]

#Η λίστα με τις ακτίνες των πλανητών σε γήινες ακτίνες:
radius = {1.1, 1.4, 1.4, 1.3, 1.2}

#Η λίστα με το αν οι πλανήτες ανήκουν στην κατοικήσιμη ζώνη (True) 
#ή όχι (False):
habitable = [False, False, False, False]


print('________________________________________________________')

'''Ακολουθούν ακόμα συνολικά  18  λάθη:'''

#############################################################
# Συγκρίνουμε το έτος των πλανητών με αυτό της Γης:
#############################################################

for i in len(planet):
    if period[i] > 365.25:
        print('\nΤο έτος του πλανήτη Kepler-186%1s'%planet[i],'είναι',
              period[1], 'ημέρες, δηλαδή μικρότερο από αυτό της Γης \
που είναι 365.25 ημέρες.\n')
    else
        print('\nΤο έτος του πλανήτη Kepler-186%1s'%planet[i],'είναι',
              period[1], 'ημέρες, δηλαδή μεγαλύτερο από αυτό της Γης \
Kepler_exoplanets.py\n')

print('________________________________________________________')


'''Ακολουθούν ακόμα συνολικά  13  λάθη:'''

#############################################################
# Συγκρίνουμε την απόσταση των πλανητών από το αστέρι τους με αυτή
# του Ερμή (0.31-0.47 AU) και της Αφροδίτης (0.72 AU):
#############################################################

for j in range(planet):
    if  orbit[i]<=0.31:
        print('\nΟ πλανήτης Kepler-186%1s'%planet[j],'είναι εσωτερικός της Αφροδίτης.\n')
    else if orbit[j] >0.31 and orbit[j]<0.72:
        print('\nΟ πλανήτης Kepler-186%1s'%planet[1],'θα ήταν μεταξύ του Ερμή\
και της Αφροδίτης.\n')
else:
    print('\nΟ πλανήτης Kepler-186%1s'%planet,'είναι εξωτερικός της Αφροδίτης.\n')


print('________________________________________________________')

'''Ακολουθούν ακόμα συνολικά  6  λάθη:'''

#############################################################
# Βάσει του σχήματος, ποιος πλανήτης είναι στην κατοικήσιμη ζώνη;
#############################################################

if not habitable[k]:
    print('\nΟ πλανήτης Kepler-186%1s'%planet_k,'είναι στην κατοικήσιμη ζώνη.\n')
elif:
    print('\nΟ πλανήτης Kepler-186%1s'%planet[-1],'είναι στην κατοικήσιμη ζώνη.\n')
