'''Αυτό ο κώδικας βρίσκει ποιος εξωπλανήτης μεταξύ πέντε γνωστών ειναι πιο
κατάλληλος για εποικισμό.'''

'''Ακολουθεί η λίστα με τους 5 εξωπλανήτες:
Σημείωση: για κάθε εξωπλανήτη δίνεται το όνομα, η επιφανειακή θερμοκρασία
σε βαθμούς Κελσίου, η απόσταση από τη Γη σε έτη φωτός, και η μάζα σε
γήινες μάζες.'''

#Πρώτος εξωπλανήτης (υπερ-Γη):
exoplanet_1 = ['55 Cancri e', 1700, 40.0, 8.6]

#Δευτερος εξωπλανήτης (γήινος):
exoplanet_2 = ['Trappist-1e', -20, 40.0, 0.6]

#Τρίτος εξωπλανήτης (θερμός αέριος τύπου Δία):
exoplanet_3 = ['Kelt-9b', 10000, 650.0, 922.2]

#Τέταρτος εξωπλανήτης (θερμός αέριος τύπου Δία):
exoplanet_4 = ['Wasp 76-b', 2400, 640.0, 286.2]

#Πέμπτος εξωπλανήτης (γήινος):
exoplanet_5 = ['Proxima b', 40, 4.2, 1.2]
